Update architecture guide document
